# üèÜ DAY 5 ‚Äî DateTime & Feature Engineering
# Customer

In [1]:
import pandas as pd

df = pd.read_csv("../New folder/Project_Assignment/Cust_Purch_FakeData.csv")
df1 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/Movies_dataset.csv')
df2 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/top_250_imdb_dataset.csv')
df3 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/Students Social Media Addiction.csv')

In [3]:
# 1Ô∏è‚É£ Convert purchase_date to datetime

df['date'] = pd.to_datetime(df['date'])
df['date'].dtypes

dtype('<M8[ns]')

In [4]:
# 2Ô∏è‚É£ Extract purchase year

df['year'] = df['date'].dt.year
df.head(1)

,prefix,first,last,email,gender,age,company,profession,phone,postal,...,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date,year
0,Dr.,Ray,Morton,sebvajom@kol.km,Male,38,Medtronic Inc.,Health Therapist,(987) 619-2695,B6V 3W3,...,5020000000000230,05/2018,Solo,8.36,Blue,126.23.139.2,Sunday,pm,1930-04-05,1930

In [5]:
# 3Ô∏è‚É£ Count purchases per year

(
    df
      .groupby('year')
      .size()
      .reset_index( name = 'count_purchases')
      .sort_values( by = 'count_purchases', ascending = False)   
)

     year  count_purchases
81   1981              220
55   1955              218
31   1931              212
122  2022              212
110  2010              206
..    ...              ...
57   1957              152
64   1964              151
121  2021              149
44   1944              146
45   1945              142

[171 rows x 2 columns]

In [25]:
#4Ô∏è‚É£ Find purchases made in 2019

(
    df[df['year'] == 2019]
        [['first','last','price(CAD)','year']]
        .sort_values(by = 'price(CAD)', ascending = False)
        .reset_index()
)

     index     first        last  price(CAD)  year
0      859    Marian      Bowman       99.76  2019
1     2629      Lena      Murphy       99.31  2019
2    13281   Timothy       Moore       98.87  2019
3    16202    Lucile      Clarke       98.44  2019
4    24197    Lenora       Owens       98.28  2019
..     ...       ...         ...         ...   ...
182  17071    Warren        Paul        1.28  2019
183  23556     Grace  Harrington        0.98  2019
184  13197  Margaret       Stone        0.57  2019
185  19248   Gregory      Chavez        0.22  2019
186  14674     Hilda      Bishop        0.07  2019

[187 rows x 5 columns]

In [6]:
# 5Ô∏è‚É£ Create column:
# High_Spender ‚Üí purchase_amount > 80
# Low_Spender ‚Üí purchase_amount < 80


df['user_type'] = df['price(CAD)'].apply(
        lambda x : 'High_Spender' if x > 80 else 'Low_Spender' )

df.head()

,prefix,first,last,email,gender,age,company,profession,phone,postal,...,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date,year,user_type
0,Dr.,Ray,Morton,sebvajom@kol.km,Male,38,Medtronic Inc.,Health Therapist,(987) 619-2695,B6V 3W3,...,05/2018,Solo,8.36,Blue,126.23.139.2,Sunday,pm,1930-04-05,1930,Low_Spender
1,Miss,Claudia,Rodriquez,acu@jatsot.ug,Female,51,"Ames Department Stores, Inc.",Health Therapist,(356) 736-7352,G7M 5F3,...,07/2028,Visa,68.31,Black,106.198.76.211,Tuesday,am,1926-12-20,1926,Low_Spender
2,Miss,Harry,Meyer,zuz@lo.wf,Female,51,CSX Corp.,Political Scientist,(539) 246-1806,A0Z 6P9,...,02/2023,Switch,34.65,Black,186.150.187.29,Wednesday,pm,1931-08-20,1931,Low_Spender
3,Miss,Edith,Gilbert,hansohsi@jupec.md,Female,55,Murphy Oil Corporation,Transportation Manager,(984) 962-7494,P9I 9H3,...,02/2028,Maestro,64.59,White,80.140.57.161,Saturday,am,2001-06-18,2001,Low_Spender
4,Dr.,Lura,Murphy,webediti@je.st,Female,20,PETsMART Inc,Statistician,(902) 568-9748,S1A 6K0,...,10/2025,Diners Club International,20.83,Yellow,211.103.43.41,Friday,pm,2045-06-14,2045,Low_Spender

# Movies

In [13]:
# 6Ô∏è‚É£ Create column:
# Is_Long ‚Üí duration > 150

df2['Is_Long'] = df2['Duration_Minutes'] > 150
df2.head()

,Rank,Title,Year,Rating,Duration_Minutes,Certificate,Source,Is_Long
0,1,The Shawshank Redemption,1994,NaN,142,R,IMDb Top 250,False
1,2,The Godfather,1972,NaN,175,R,IMDb Top 250,True
2,3,The Dark Knight,2008,NaN,152,PG-13,IMDb Top 250,True
3,4,The Godfather Part II,1974,NaN,202,R,IMDb Top 250,True
4,5,12 Angry Men,1957,NaN,96,Approved,IMDb Top 250,False

In [19]:
# 7Ô∏è‚É£ Extract decade from year

df2['Decade'] = (df2['Year'] // 10) *10
df2.head()

,Rank,Title,Year,Rating,Duration_Minutes,Certificate,Source,Is_Long,Decade
0,1,The Shawshank Redemption,1994,NaN,142,R,IMDb Top 250,False,1990
1,2,The Godfather,1972,NaN,175,R,IMDb Top 250,True,1970
2,3,The Dark Knight,2008,NaN,152,PG-13,IMDb Top 250,True,2000
3,4,The Godfather Part II,1974,NaN,202,R,IMDb Top 250,True,1970
4,5,12 Angry Men,1957,NaN,96,Approved,IMDb Top 250,False,1950

In [20]:
# 8Ô∏è‚É£ Count movies per decade

(
    df2
       .groupby('Decade')
        .size()
       .reset_index(name = 'total')
)

    Decade  total
0     1920      6
1     1930      6
2     1940     11
3     1950     21
4     1960     16
5     1970     19
6     1980     26
7     1990     39
8     2000     47
9     2010     45
10    2020     14

# Students

In [26]:
# 9Ô∏è‚É£ Create Addiction_Level column:

# 0‚Äì4 ‚Üí Low

# 5‚Äì7 ‚Üí Medium

# 8‚Äì10 ‚Üí High



df3['Addiction_Level'] = df3['Addicted_Score'].apply(
    lambda a : 'Low' if 0 <= a <= 4  else 'Medium' if 5 <= a <= 7 else 'High'
)
df3.head()

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score,Addiction_Level
0,1,19,Female,Undergraduate,Bangladesh,5.2,Instagram,Yes,6.5,6,In Relationship,3,8,High
1,2,22,Male,Graduate,India,2.1,Twitter,No,7.5,8,Single,0,3,Low
2,3,20,Female,Undergraduate,USA,6.0,TikTok,Yes,5.0,5,Complicated,4,9,High
3,4,18,Male,High School,UK,3.0,YouTube,No,7.0,7,Single,1,4,Low
4,5,21,Male,Graduate,Canada,4.5,Facebook,Yes,6.0,6,In Relationship,2,7,Medium

In [27]:
# üîü Count students per Addiction_Level

(
    df3
       .groupby('Addiction_Level')
        .size()
        .reset_index( name = 'Total_Student')
)

  Addiction_Level  Total_Student
0            High            199
1             Low            100
2          Medium            406